{
  "Home": {
    "name": "Dor Bergel",
    "title": "Software Developer | QA & Automation Engineer",
    "description": "QA Automation Engineer with a strong foundation in backend development",
    "about_me_summary": "Hi, I’m Dor — a QA Automation Engineer with a growing passion for backend development. I enjoy writing clean, reliable code and working with tools like Python, C++, and Jenkins to improve system quality. Lately, I’ve been focusing on expanding my software development skills and building projects that reflect that journey."
  },
  "About": {
    "about-intro": "I'm Dor Bergel, a QA Automation Engineer with a deep interest in backend development. I enjoy building systems that are both reliable and maintainable, using technologies like Python, C++, Jenkins, and Git. My background in automation has taught me how to think systematically, test thoroughly, and always aim for improvement. I'm currently focused on sharpening my software development skills and contributing to projects that make an impact.",

    "why-me": "I bring a unique blend of QA precision and developer mindset. My work is rooted in clarity, curiosity, and continuous learning. Whether I’m writing tests or developing backend logic, I care about building things that work — and keep working. I’m not just chasing the latest tech trend — I’m committed to writing dependable code, collaborating well, and always asking how we can do better.",

    "work_experience": [
      {
        "position": "QA Automation Engineer",
        "company": "Softil Ltd.",
        "duration": "2022 – Present",
        "responsibilities": [
          "Developed and optimized UI automation tests using Python and MongoDB to ensure application stability.",
          "Built and maintained automation infrastructure integrated with Jenkins and Git for CI/CD workflows.",
          "Ran performance tests and analyzed results to maintain high responsiveness under load.",
          "Worked closely with QA and development teams to identify bugs and improve test coverage using Jira."
        ]
      }
    ],

    "education": [
      {
        "degree": "B.Sc. in Computer Science",
        "institution": "Holon Institute of Technology",
        "duration": "2021 – 2024",
        "content": [
          "Focused on software engineering, backend systems, and automation.",
          "Built hands-on projects in C++, Python, and JavaScript.",
          "Strengthened knowledge in networking, data structures, and testing strategies."
        ]
      }
    ]
  },
  "Shared": {
    "iconSkills": [
      "javascript",
      "react",
      "nodejs",
      "python",
      "java",
      "csharp",
      "typescript",
      "html5",
      "css3",
      "docker",
      "kubernetes"
    ],
    "projects": [
      {
  "projectName": "NetWatch",
  "description": "A real-time network monitoring CLI tool built in C using raw sockets.",
  "technologies": ["C", "Raw Sockets", "Linux", "ncurses"],
  "link": "https://github.com/DorBergel/NetWatch",
  "image": "/images/projects/netwatch.png",
  "objective": "To demonstrate low-level systems programming skills by capturing and analyzing network traffic in real time.",
  "keyAchievements": [
    "Built a raw socket packet sniffer using AF_PACKET on Linux.",
    "Parsed Ethernet, IP, TCP, UDP, and ICMP headers manually.",
    "Displayed live protocol statistics using ncurses for a terminal-based UI.",
    "Implemented connection tracking and real-time packet/byte counters."
  ],
  "impactAndFutureWork": "NetWatch offers insight into Linux networking internals and packet inspection. Future updates may include file logging, filtering by interface/protocol, and cross-platform compatibility."
},
      {
        "projectName": "Pink Floyd Browser",
        "description": "A Python TCP client-server app for browsing Pink Floyd’s discography using a text database.",
        "technologies": ["Python", "Sockets", "Text Processing"],
        "link": "https://github.com/DorBergel/Pink-Floyd-Browser",
        "image": "/images/projects/Pink-Floyd-Browser.png",
        "objective": "To demonstrate network programming fundamentals in Python by simulating a music discography browser.",
        "keyAchievements": [
          "Established a socket-based client-server model in Python.",
          "Parsed and served album data from a structured text file.",
          "Designed a lightweight terminal interface for browsing."
        ],
        "impactAndFutureWork": "Provides a strong foundation for learning networking basics. Future work may include concurrency support and enhanced user navigation."
      },
      {
        "projectName": "Gender Detection via Text",
        "description": "Predicts an author's gender based on linguistic features using classic NLP methods.",
        "technologies": ["Python", "NLTK", "scikit-learn", "pandas"],
        "link": "https://github.com/DorBergel/Gender-Detection",
        "image": "/images/projects/Gender-Detection.png",
        "objective": "To analyze gender-specific linguistic patterns and build a machine learning model for prediction.",
        "keyAchievements": [
          "Cleaned and vectorized raw text data for feature extraction.",
          "Trained and evaluated multiple classifiers on annotated corpora.",
          "Demonstrated high classification accuracy using classical ML models."
        ],
        "impactAndFutureWork": "Opens opportunities for ethical discussion and further analysis using deep learning models or multilingual datasets."
      },
      {
        "projectName": "Vinyl Price Prediction",
        "description": "A regression model predicting vinyl record prices based on condition, artist, and other metadata.",
        "technologies": ["Python", "pandas", "scikit-learn", "Jupyter"],
        "link": "https://github.com/DorBergel/Vinyl-Price-Prediction",
        "image": "/images/projects/Vynil-Price-Prediction.png",
        "objective": "To assist collectors and resellers in valuing vinyl records based on data trends.",
        "keyAchievements": [
          "Performed exploratory data analysis and preprocessing.",
          "Trained regression models on curated vinyl data.",
          "Delivered price estimates with meaningful accuracy."
        ],
        "impactAndFutureWork": "Could be extended into a web-based appraisal tool with richer datasets and pricing logic."
      },
      {
        "projectName": "Hangman Game",
        "description": "A terminal-based Hangman game built in Python using file I/O and randomization.",
        "technologies": ["Python"],
        "link": "https://github.com/DorBergel/Hangman",
        "image": "/images/projects/Hangman.png",
        "objective": "To create a simple command-line game showcasing core Python skills.",
        "keyAchievements": [
          "Implemented gameplay loop and input checks.",
          "Used external word list with file operations.",
          "Randomized word choice for replayability."
        ],
        "impactAndFutureWork": "Could evolve into a GUI-based version or online multiplayer mode."
      },
      {
        "projectName": "Breaking Bad WinForms App",
        "description": "A c-sharp WinForms desktop application inspired by Breaking Bad with interactive multimedia features.",
        "technologies": ["c-sharp", ".NET Framework", "WinForms"],
        "link": "https://github.com/DorBergel/Breaking-Bad",
        "image": "/images/projects/breaking-bad.png",
        "objective": "To apply UI design and event handling in a desktop application inspired by a popular TV show.",
        "keyAchievements": [
          "Implemented responsive WinForms interface.",
          "Integrated images and audio for immersive experience.",
          "Used Visual Studio and .NET tooling to compile and test."
        ],
        "impactAndFutureWork": "Can serve as a base for themed educational apps or interactive desktop utilities."
      },
      {
        "projectName": "Net Stat Check",
        "description": "A Python tool for checking internet connectivity and displaying IP status, bundled as an executable.",
        "technologies": ["Python", "PyInstaller", "subprocess"],
        "link": "https://github.com/DorBergel/Net-Stat-Check",
        "image": "/images/projects/Net-Stat.png",
        "objective": "To offer a simple tool for users to verify internet connection without requiring Python installed.",
        "keyAchievements": [
          "Used subprocess to run platform-specific network commands.",
          "Packaged tool with PyInstaller into a Windows executable.",
          "Minimized footprint and improved usability for non-developers."
        ],
        "impactAndFutureWork": "Could include GUI, system tray support, or cross-platform builds."
      },
      {
        "projectName": "Real-Time Chat App",
        "description": "A real-time chat application enabling seamless communication using WebSockets and MongoDB.",
        "technologies": [
          "Node.js",
          "Express",
          "Socket.IO",
          "MongoDB",
          "HTML",
          "CSS",
          "JavaScript"
        ],
        "link": "https://github.com/DorBergel/Real-Time-Chat-App",
        "image": "/images/projects/Real-Time-Chat-App.png",
        "objective": "To create a robust and real-time communication platform that supports persistent chat rooms and instantaneous message delivery using WebSockets.",
        "keyAchievements": [
          "Implemented Socket.IO for real-time, bi-directional communication between users.",
          "Integrated MongoDB to store chat history and user data persistently.",
          "Built a responsive front-end interface with clean user interaction.",
          "Designed modular server-side architecture for scalability and easy feature extension."
        ],
        "impactAndFutureWork": "This project served as a foundation for understanding event-driven architecture and real-time web applications. Future improvements may include authentication with JWT, user presence indicators, and support for media messages and private rooms."
      }
    ],
    "skills": [
      "c",
      "c++",
      "c-sharp",
      "python",
      "html",
      "css",
      "bootstrap",
      "javascript",
      "nodejs",
      "react",
      "expressjs",
      "kotlin",
      "linux",
      "bash",
      "git",
      "jenkins",
      "mongodb",
      "postman",
      "jira",
      "selenium",
      "github copilot",
      "tcp",
      "udp",
      "dns",
      "sip",
      "sdp",
      "qa automation scripts",
      "results analysis"
    ],
    "carouselSkills": [
      "bash",
      "c",
      "c++",
      "copilot",
      "css",
      "expressjs",
      "git",
      "github",
      "html",
      "kotlin",
      "linux",
      "mongodb",
      "websocket",
      "pandas",
      "nodejs",
      "postman",
      "python",
      "react",
      "jenkins",
      "jira"
    ],
    "contact": {
      "email": "dor.bergel9@gmail.com",
      "github": "https://github.com/DorBergel",
      "linkedin": "https://www.linkedin.com/in/dor-bergel/"
    },
    "tech-table": [
      {
        "name": "Languages",
        "skills": ["c", "c++", "c-sharp", "python", "javascript", "kotlin"],
        "content": "Proficient in multiple programming languages, with a focus on C++, Python, and JavaScript for backend and automation tasks."
      },
      {
        "name": "Frameworks & Libraries",
        "skills": ["react", "expressjs", "selenium", "bootstrap", "NET"],
        "content": "Experienced in using React for frontend development, Express.js for backend services, and Selenium for automation testing."
      },
      {
        "name": "Networking & Tools",
        "skills": [
          "OSI Model",
          "Stracture",
          "Metasploit",
          "Wireshark",
          "Scapy"
        ],
        "content": "Knowledgeable in networking concepts and tools, including the OSI model, network structure, and security testing with Metasploit and Wireshark."
      },
      {
        "name": "Tools & Technologies",
        "skills": ["git", "jenkins", "mongodb", "postman", "jira", "selenium"],
        "content": "Proficient in version control with Git, familiar with CI/CD pipelines using Jenkins, and experienced in database management with MongoDB. Skilled in API testing with Postman and project"
      }
    ]
  }
}
